source/5_Lesson.org
#+STARTUP:indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
#+HTML_HEAD_EXTRA: <script src="http://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js" type="text/javascript"></script>
#+HTML_HEAD_EXTRA: <script src="js/navbar.js" type="text/javascript"></script>
#+OPTIONS: f:nil author:nil num:1 creator:nil timestamp:nil toc:nil html-style:nil

#+TITLE: Little Big Data
#+AUTHOR: Stephen Brown

#+BEGIN_HTML
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-CS-bigData">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
    </ul>
  </div>
#+END_HTML
* COMMENT Use as a template
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:

** Design It
:PROPERTIES:
:HTML_CONTAINER_CLASS: design
:END:

** Build It
:PROPERTIES:
:HTML_CONTAINER_CLASS: build
:END:

** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:

** Run It
:PROPERTIES:
:HTML_CONTAINER_CLASS: run
:END:

** Document It
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:

** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:

** Program It
:PROPERTIES:
:HTML_CONTAINER_CLASS: program
:END:

** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

** Save It
:PROPERTIES:
:HTML_CONTAINER_CLASS: save
:END:

* Ethics
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
- Big data could have a number of benefits to our everyday lives...
- Watch the video above. Discuss with a partner: 
    - Which ideas in the video do you like the idea of? 
    - What data are be needed in order to allow all the different functions that were shown? 
** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:
- In 2009, a German green party policician named Malte Spitz asked his mobile provider to provide all the data they collected on him over the space of six months. 
- They refused, and so he sued them which allowed him to obtain the data.
- As you would expect, the phone company's systems automatically tracked how many calls he made and received, but also stored a huge amount of geolocation data. 
- By combining this with publicly available data from other sources (e.g. web sites, Tweets), Zeit newspaper journalists were able to produce a detailed account of his life.
- You can re-live Malte's life [[http://www.zeit.de/datenschutz/malte-spitz-data-retention][here]]. Click the 'play' button to start.
** Further reading
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:
- Big data on [[https://en.wikipedia.org/wiki/Big_data][Wikipedia]]
- LinkedIn article on [[https://www.linkedin.com/pulse/20130827231108-64875646-big-data-the-mega-trend-that-will-impact-all-our-lives][big data]], featuring examples
- The Guardian: [[http://www.theguardian.com/technology/big-data][big data news stories]]
- Real-world examples of [[https://econsultancy.com/blog/63594-10-actual-uses-of-big-data/][big data in action]]
- [[http://www.newstatesman.com/sci-tech/2015/02/we-give-doors-and-toasters-sentience-we-should-decide-what-were-comfortable-first][New Statesman]] article about concerns surrounding  [[https://en.wikipedia.org/wiki/Internet_of_Things][Internet of Things]] and big data
- UK parliament enquiry - [[http://www.parliament.uk/business/committees/committees-a-z/commons-select/science-and-technology-committee/inquiries/parliament-2015/big-data/][The Big Data Dilemma]] (27/7/15 to 3/9/15)
** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
- Both Governments, businesses and private citizens are showing an increasing interest in big data. Write a report explaining big data for a non-technical adult audience. You should include:
    - What is meant by the term, 'big data'?
    - Describe some examples of big data projects
    - What good can come from big data?
    - Why do some people dislike the idea of gathering and using big data?
    - How do you feel about the use of big data?
- Cite sources for any web pages you have used in your research. You must reference at least two different sources in your research. Some are given above, but there are plenty of other sources online. 

- *Silver:* A short report, giving brief answers to each of the questions. 
- *Gold:* A more detailed report showing good levels of research, and offering analysis and comment.
- *Platinum:* A comprehensive, well-written report giving examples, citing multiple sources and drawing well-reasoned conclusions based on evidence gathered through research. 
