pages/5_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Little Big Data</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Little Big Data</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-CS-bigData">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Ethics</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Big data could have a number of benefits to our everyday lives&#x2026;
</li>
<li>Watch the video above. Discuss with a partner: 
<ul class="org-ul">
<li>Which ideas in the video do you like the idea of? 
</li>
<li>What data are be needed in order to allow all the different functions that were shown? 
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 try">
<h3 id="sec-1-2">Try It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>In 2009, a German green party policician named Malte Spitz asked his mobile provider to provide all the data they collected on him over the space of six months. 
</li>
<li>They refused, and so he sued them which allowed him to obtain the data.
</li>
<li>As you would expect, the phone company's systems automatically tracked how many calls he made and received, but also stored a huge amount of geolocation data. 
</li>
<li>By combining this with publicly available data from other sources (e.g. web sites, Tweets), Zeit newspaper journalists were able to produce a detailed account of his life.
</li>
<li>You can re-live Malte's life <a href="http://www.zeit.de/datenschutz/malte-spitz-data-retention">here</a>. Click the 'play' button to start.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 research">
<h3 id="sec-1-3">Further reading</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Big data on <a href="https://en.wikipedia.org/wiki/Big_data">Wikipedia</a>
</li>
<li>LinkedIn article on <a href="https://www.linkedin.com/pulse/20130827231108-64875646-big-data-the-mega-trend-that-will-impact-all-our-lives">big data</a>, featuring examples
</li>
<li>The Guardian: <a href="http://www.theguardian.com/technology/big-data">big data news stories</a>
</li>
<li>Real-world examples of <a href="https://econsultancy.com/blog/63594-10-actual-uses-of-big-data/">big data in action</a>
</li>
<li><a href="http://www.newstatesman.com/sci-tech/2015/02/we-give-doors-and-toasters-sentience-we-should-decide-what-were-comfortable-first">New Statesman</a> article about concerns surrounding  <a href="https://en.wikipedia.org/wiki/Internet_of_Things">Internet of Things</a> and big data
</li>
<li>UK parliament enquiry - <a href="http://www.parliament.uk/business/committees/committees-a-z/commons-select/science-and-technology-committee/inquiries/parliament-2015/big-data/">The Big Data Dilemma</a> (27/7/15 to 3/9/15)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 badge">
<h3 id="sec-1-4">Badge It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Both Governments, businesses and private citizens are showing an increasing interest in big data. Write a report explaining big data for a non-technical adult audience. You should include:
<ul class="org-ul">
<li>What is meant by the term, 'big data'?
</li>
<li>Describe some examples of big data projects
</li>
<li>What good can come from big data?
</li>
<li>Why do some people dislike the idea of gathering and using big data?
</li>
<li>How do you feel about the use of big data?
</li>
</ul>
</li>
<li>Cite sources for any web pages you have used in your research. You must reference at least two different sources in your research. Some are given above, but there are plenty of other sources online. 
</li>

<li><b>Silver:</b> A short report, giving brief answers to each of the questions. 
</li>
<li><b>Gold:</b> A more detailed report showing good levels of research, and offering analysis and comment.
</li>
<li><b>Platinum:</b> A comprehensive, well-written report giving examples, citing multiple sources and drawing well-reasoned conclusions based on evidence gathered through research. 
</li>
</ul>
</div>
</div>
</body>
</html>
